emacs/config.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Repos &amp; Core Packages</a>
<ul>
<li><a href="#sec-1-1">Melpa</a></li>
<li><a href="#sec-1-2">Setup <code>use-package</code> if isn't already</a></li>
</ul>
</li>
<li><a href="#sec-2">Core Setup</a>
<ul>
<li><a href="#sec-2-1">Basic Stuff</a></li>
<li><a href="#sec-2-2">Themes</a></li>
</ul>
</li>
<li><a href="#sec-3">Evil Mode</a></li>
<li><a href="#sec-4">Ivy</a></li>
<li><a href="#sec-5">Key Bindings</a></li>
<li><a href="#sec-6">Writting</a>
<ul>
<li><a href="#sec-6-1">Org Mode</a></li>
<li><a href="#sec-6-2">Markdown</a></li>
</ul>
</li>
<li><a href="#sec-7">Development</a>
<ul>
<li><a href="#sec-7-1">Auto Complete</a></li>
<li><a href="#sec-7-2">Indentation</a></li>
<li><a href="#sec-7-3">Parens</a></li>
<li><a href="#sec-7-4">Git</a></li>
<li><a href="#sec-7-5">Projects</a></li>
<li><a href="#sec-7-6">Pretty Code</a></li>
</ul>
</li>
<li><a href="#sec-8">My Random Functions</a>
<ul>
<li><a href="#sec-8-1">Zoom-Window</a></li>
<li><a href="#sec-8-2">eshell-clear-buffer</a></li>
</ul>
</li>
<li><a href="#sec-9">Load Other Configs</a>
<ul>
<li><a href="#sec-9-1">Work Settings</a></li>
<li><a href="#sec-9-2">Linux</a></li>
</ul>
</li>
<li><a href="#sec-10">The Rest</a>
<ul>
<li><a href="#sec-10-1">Auto Generated Stuff</a></li>
<li><a href="#sec-10-2">Theme Load</a></li>
</ul>
</li>
</ul>
</div>
</div>

So I just learned about the org babel stuff, and I think I might save
my emacs configuration in an org file like this, and then have emacs
just load it with org-babel&#x2026; It deff makes it easier to navigate
around the file&#x2026;

# Repos & Core Packages<a id="sec-1" name="sec-1"></a>

## Melpa<a id="sec-1-1" name="sec-1-1"></a>

Melpa is the big package repo that nearly *everything* can be
found. It's a must for emacs configs.

    (require 'package)
    (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
    (package-initialize)

## Setup `use-package` if isn't already<a id="sec-1-2" name="sec-1-2"></a>

    (unless (package-installed-p 'use-package)
      (package-refresh-contents)
      (package-install 'use-package))
    
    (eval-when-compile
      (require 'use-package))

# Core Setup<a id="sec-2" name="sec-2"></a>

## Basic Stuff<a id="sec-2-1" name="sec-2-1"></a>

Remove splash screen and use **scratch** instead as the home buffer

    (setq inhibit-startup-message t
          inhibit-startup-echo-area-message t)

Funnel all the auto backup files to one location.

    (setq backup-directory-alist '(("." . "~/nextcloud/emacs/backups")))

Switch line numbers on by default in all buffers

    (global-linum-mode 1)

Switch the Menubar off by default (I like to keep everything clean)

    (menu-bar-mode -1)

New lines auto indents

    (define-key global-map (kbd "RET")
      'newline-and-indent)

Tool Tips in echo area

    (tooltip-mode -1)
    (setq tooltip-use-echo-area t)

Smooth Scrolling

    ;;(require 'smooth-scroll)

## Themes<a id="sec-2-2" name="sec-2-2"></a>

    (use-package monokai-alt-theme
      :ensure t)
    ;;  (use-package gruvbox-theme
    ;;         :ensure t)
    ;; (use-package darkokai-theme
    ;;         :ensure t)
    ;; (use-package darktooth-theme
    ;;         :ensure t)
    ;; (use-package creamsody-theme
    ;;         :ensure t)
    ;; (use-package github-theme
    ;;   :ensure t)

# Evil Mode<a id="sec-3" name="sec-3"></a>

Here is my Evile Mode setup. I've nested other `use-pacages` inside of
it, so that if I am using `evil`, the packages that depend on it go
ahead and configure themselves.

    ;; Evil Mode
    (use-package evil
      :ensure t
      :config
    
      (evil-mode 1)
      (use-package evil-leader
        :ensure t
        :config
        (global-evil-leader-mode t)
        (evil-leader/set-leader "<SPC>")
        (evil-leader/set-key
          "s s" 'swiper
          "d x w" 'delete-trailing-whitespace)) 
    
      (use-package evil-surround
        :ensure t
        :config (global-evil-surround-mode))
    
      (use-package evil-indent-textobject
        :ensure t)
    
      (use-package evil-org
        :ensure t
        :config
        (evil-org-set-key-theme '(textobjects insert navigation additional shift todo heading))
        (add-hook 'org-mode-hook (lambda () (evil-org-mode))))
    
      (use-package powerline-evil
        :ensure t
        :config
        (powerline-evil-vim-color-theme)
        )
      )

# Ivy<a id="sec-4" name="sec-4"></a>

Setup and use Ivy

    (use-package ivy
      :ensure t
      :config
      (ivy-mode 1)
      (setq ivy-use-virtual-buffers t)
      (setq enable-recursive-minibuffers t)
      ;; Ivy Keybindings
      (global-set-key (kbd "C-c C-r") 'ivy-resume))

Configure Swiper

    (use-package swiper
      :ensure t
      :config
      (global-set-key "\C-s" 'swiper)
      )

Counsel configuration

    (use-package counsel 
      :ensure t
      :config 
      (global-set-key (kbd "M-x") 'counsel-M-x)
      (global-set-key (kbd "C-x C-f") 'counsel-find-file))

# Key Bindings<a id="sec-5" name="sec-5"></a>

These will eventually be relocations to just be included with their
respective `use-package` calls&#x2026;

    ;; Spell Check Word key-binds
    (global-set-key (kbd "C-c w") 'ispell-word)
    (global-set-key (kbd "C-c r") 'ispell-region)
    
    ;; ;; Toggle menubar keybind
    (global-set-key (kbd "C-c m") 'menu-bar-mode)
    
    ;; ;; Eshell launch keybind
    (global-set-key (kbd "C-c t") 'eshell)
    
    ;; ;; Comment/Uncomment region
    (global-set-key (kbd "C-c ;") 'comment-region)
    
    
    ;; Previous Window shortcut
    (global-set-key (kbd "C-x p")
                    (lambda() (interactive) (other-window -1)))
    (global-set-key (kbd "C-x O")
                    (lambda() (interactive) (switch-window)))
    (global-set-key (kbd "C-x o")
                    (lambda() (interactive) (other-window 1)))
    (global-set-key (kbd "C-x \)")
                    (lambda() (interactive) (other-frame 1)))
    (global-set-key (kbd "C-x 0")
                    (lambda() (interactive) (delete-window)))
    
    (global-set-key (kbd "C-c z") 'zoom-window)
