emacs/config.org
** Org Mode
Yes. It get's it's own section. Again, I've nested everything. I might
break that up though now if I the babel stuff to generate my
configs...
#+BEGIN_SRC emacs-lisp
(use-package org
  :ensure t
  :config

  (setq org-todo-keywords '((sequence "TODO" "In Progress" "|" "Waiting" "DONE" "DONE DONE")))

  (evil-leader/set-key-for-mode 'org-mode
    "m i" 'org-clock-in
    "m C" 'org-toggle-checkbox
    "m o" 'org-clock-out
    "m c" 'org-clock-jump-to-current-clock
    "m d" 'org-clock-display
    "m e" 'org-set-effort
    "m p" 'org-pomodoro
    "m t" 'org-set-tags-command
    "m m" 'org-clock-modify-effort-estimate
    "m s" 'org-schedule)
  
  ;; ;; Org Agenda stuff
  (setq org-agenda-files '("~/nextcloud/emacs/org/archive/work.org"))
  
  (defun org-code (start end)
    "Wraps selected text with org code tags"
    (interactive "r")
    (let ((selected-text (buffer-substring (mark) (point)))
  	  (db-name (read-from-minibuffer "Language[common-lisp]: ")))
      (when (eq db-name "")
  	(setf db-name "common-lisp"))
      (kill-region start end)
      (insert (format "#+BEGIN_SRC %s \n%s \n#+END_SRC" db-name selected-text))))

  (use-package org-pomodoro
    :ensure t
    :config
    ;; Persistent Clocking
    (setq org-clock-persist 'history)
    (org-clock-persistence-insinuate)

    ;; Default Table Params
    (setq org-clock-clocktable-default-properties '(:maxlevel 3 :scope subtree :tags "-Lunch"))


    ;; Org Pomodoro ;;
    ;; Setup pomodoro timer keybind
    (global-set-key (kbd "C-S-c C-S-p") 'org-pomodoro)
    (global-set-key (kbd "C-S-c C-S-e") 'org-pomodoro-extend-last-clock)

    (defun org-pomodoro-get-times ()
      (interactive)
      (message "work length: %s  short break: %s  long break: %s"
    	       org-pomodoro-length
    	       org-pomodoro-short-break-length
    	       org-pomodoro-long-break-length))

    (defun org-pomodoro-set-pomodoro ()
      (interactive)
      (setf org-pomodoro-length 35)
      (setf org-pomodoro-short-break-length 9)
      (setf org-pomodoro-long-break-length 15))


    (org-pomodoro-set-pomodoro)

    (defun org-pomodoro-set-52-17 ()
      (interactive)
      (setf org-pomodoro-length 52)
      (setf org-pomodoro-short-break-length 17)
      (setf org-pomodoro-long-break-length 17)))
  )

#+END_SRC
** Markdown
#+BEGIN_SRC emacs-lisp
(use-package markdown-mode
  :ensure t)
#+END_SRC

* Development
** Auto Complete
#+BEGIN_SRC emacs-lisp
(use-package auto-complete
  :ensure t
  :config
  (ac-config-default))
#+END_SRC
** Indentation
=aggressive-indent= automatically indents buffers as I type out my
code. I love it.
#+BEGIN_SRC emacs-lisp
(use-package aggressive-indent
  :ensure t
  :config
  (global-aggressive-indent-mode t))
#+END_SRC
** Parens
smart parens does auto paring for my parenthesis
#+BEGIN_SRC emacs-lisp
(use-package smartparens
  :ensure t
  :config
  ;; Remove ' and  from pairing
  (sp-pair "'" nil :actions :rem)
  (sp-pair "`" "'" :actions :rem))
#+END_SRC
** Git
I use magit for easy git management
#+BEGIN_SRC emacs-lisp
(use-package magit
  :ensure t
  :config 
  (global-set-key (kbd "C-c g") 'magit-status))
#+END_SRC

** Projects
Starting to learn projectile a little bit...
#+BEGIN_SRC emacs-lisp
(use-package projectile
  :ensure t
  :config
  (projectile-global-mode)

  (use-package counsel-projectile
    :ensure t
    )
  )
#+END_SRC
** Pretty Code
#+BEGIN_SRC emacs-lisp
;; (require 'pretty-mode)
;; (pretty-lambda-mode t)

;;(global-pretty-lambda-mode t)
#+END_SRC
* My Random Functions
** Zoom-Window
Saves the current state of the buffers, and then zooms the current
buffer full screen. When called again, goes back to origonal buffer
setup.
#+BEGIN_SRC emacs-lisp
(defun zoom-window ()
  (interactive)
  (if zoom-temp-window-configuration
      (progn
        (set-window-configuration zoom-temp-window-configuration)
	(setq zoom-temp-window-configuration nil)
        (message "Window un-zoomed"))
    (progn
      (setq zoom-temp-window-configuration (current-window-configuration))
      (delete-other-windows)
      (message "Window zoomed"))))
#+END_SRC
** eshell-clear-buffer
Clears my eshell more like a normal terminal would
#+BEGIN_SRC emacs-lisp
(defun eshell-clear-buffer ()
  "Clear terminal"
  (interactive)
  (let ((inhibit-read-only t))
    (erase-buffer)
    (eshell-send-input)))
#+END_SRC

I need this hook for the function, and I like to set it to a keybind:
#+BEGIN_SRC emacs-lisp
(add-hook 'eshell-mode-hook
	  '(lambda()
	     (local-set-key (kbd "C-l") 'eshell-clear-buffer)))

(global-set-key (kbd "C-c <delete>") 'eshell-clear-buffer)
#+END_SRC
* Load Other Configs
** Work Settings
Load functions for using Allegro when on Work computer
#+BEGIN_SRC emacs-lisp
(when (string-equal (upcase system-name) "LAFAYETTE")
  (load "~/.emacs-work.el"))
#+END_SRC
** Linux
Load my Linux-specific configs
#+BEGIN_SRC emacs-lisp
(when (string-equal system-type "gnu/linux")
  (load "~/.emacs-linux.el"))
#+END_SRC
* The Rest
