emacs/config.md

# Writting<a id="sec-6" name="sec-6"></a>

## Org Mode<a id="sec-6-1" name="sec-6-1"></a>

Yes. It get's it's own section. Again, I've nested everything. I might
break that up though now if I the babel stuff to generate my
configs&#x2026;

    (use-package org
      :ensure t
      :config
    
      (setq org-todo-keywords '((sequence "TODO" "In Progress" "|" "Waiting" "DONE" "DONE DONE")))
    
      (evil-leader/set-key-for-mode 'org-mode
        "m i" 'org-clock-in
        "m C" 'org-toggle-checkbox
        "m o" 'org-clock-out
        "m c" 'org-clock-jump-to-current-clock
        "m d" 'org-clock-display
        "m e" 'org-set-effort
        "m p" 'org-pomodoro
        "m t" 'org-set-tags-command
        "m m" 'org-clock-modify-effort-estimate
        "m s" 'org-schedule)
    
      ;; ;; Org Agenda stuff
      (setq org-agenda-files '("~/nextcloud/emacs/org/archive/work.org"))
    
      (defun org-code (start end)
        "Wraps selected text with org code tags"
        (interactive "r")
        (let ((selected-text (buffer-substring (mark) (point)))
              (db-name (read-from-minibuffer "Language[common-lisp]: ")))
          (when (eq db-name "")
            (setf db-name "common-lisp"))
          (kill-region start end)
          (insert (format "#+BEGIN_SRC %s \n%s \n#+END_SRC" db-name selected-text))))
    
      (use-package org-pomodoro
        :ensure t
        :config
        ;; Persistent Clocking
        (setq org-clock-persist 'history)
        (org-clock-persistence-insinuate)
    
        ;; Default Table Params
        (setq org-clock-clocktable-default-properties '(:maxlevel 3 :scope subtree :tags "-Lunch"))
    
    
        ;; Org Pomodoro ;;
        ;; Setup pomodoro timer keybind
        (global-set-key (kbd "C-S-c C-S-p") 'org-pomodoro)
        (global-set-key (kbd "C-S-c C-S-e") 'org-pomodoro-extend-last-clock)
    
        (defun org-pomodoro-get-times ()
          (interactive)
          (message "work length: %s  short break: %s  long break: %s"
                   org-pomodoro-length
                   org-pomodoro-short-break-length
                   org-pomodoro-long-break-length))
    
        (defun org-pomodoro-set-pomodoro ()
          (interactive)
          (setf org-pomodoro-length 35)
          (setf org-pomodoro-short-break-length 9)
          (setf org-pomodoro-long-break-length 15))
    
    
        (org-pomodoro-set-pomodoro)
    
        (defun org-pomodoro-set-52-17 ()
          (interactive)
          (setf org-pomodoro-length 52)
          (setf org-pomodoro-short-break-length 17)
          (setf org-pomodoro-long-break-length 17)))
      )

## Markdown<a id="sec-6-2" name="sec-6-2"></a>

    (use-package markdown-mode
      :ensure t)

# Development<a id="sec-7" name="sec-7"></a>

## Auto Complete<a id="sec-7-1" name="sec-7-1"></a>

    (use-package auto-complete
      :ensure t
      :config
      (ac-config-default))

## Indentation<a id="sec-7-2" name="sec-7-2"></a>

`aggressive-indent` automatically indents buffers as I type out my
code. I love it.

    (use-package aggressive-indent
      :ensure t
      :config
      (global-aggressive-indent-mode t))

## Parens<a id="sec-7-3" name="sec-7-3"></a>

smart parens does auto paring for my parenthesis

    (use-package smartparens
      :ensure t
      :config
      ;; Remove ' and  from pairing
      (sp-pair "'" nil :actions :rem)
      (sp-pair "`" "'" :actions :rem))

## Git<a id="sec-7-4" name="sec-7-4"></a>

I use magit for easy git management

    (use-package magit
      :ensure t
      :config 
      (global-set-key (kbd "C-c g") 'magit-status))

## Projects<a id="sec-7-5" name="sec-7-5"></a>

Starting to learn projectile a little bit&#x2026;

    (use-package projectile
      :ensure t
      :config
      (projectile-global-mode)
    
      (use-package counsel-projectile
        :ensure t
        )
      )

## Pretty Code<a id="sec-7-6" name="sec-7-6"></a>

    ;; (require 'pretty-mode)
    ;; (pretty-lambda-mode t)
    
    ;;(global-pretty-lambda-mode t)

# My Random Functions<a id="sec-8" name="sec-8"></a>

## Zoom-Window<a id="sec-8-1" name="sec-8-1"></a>

Saves the current state of the buffers, and then zooms the current
buffer full screen. When called again, goes back to origonal buffer
setup.

    (defun zoom-window ()
      (interactive)
      (if zoom-temp-window-configuration
          (progn
            (set-window-configuration zoom-temp-window-configuration)
            (setq zoom-temp-window-configuration nil)
            (message "Window un-zoomed"))
        (progn
          (setq zoom-temp-window-configuration (current-window-configuration))
          (delete-other-windows)
          (message "Window zoomed"))))

## eshell-clear-buffer<a id="sec-8-2" name="sec-8-2"></a>

Clears my eshell more like a normal terminal would

    (defun eshell-clear-buffer ()
      "Clear terminal"
      (interactive)
      (let ((inhibit-read-only t))
        (erase-buffer)
        (eshell-send-input)))

I need this hook for the function, and I like to set it to a keybind:

    (add-hook 'eshell-mode-hook
              '(lambda()
                 (local-set-key (kbd "C-l") 'eshell-clear-buffer)))
    
    (global-set-key (kbd "C-c <delete>") 'eshell-clear-buffer)

# Load Other Configs<a id="sec-9" name="sec-9"></a>

## Work Settings<a id="sec-9-1" name="sec-9-1"></a>

Load functions for using Allegro when on Work computer

    (when (string-equal (upcase system-name) "LAFAYETTE")
      (load "~/.emacs-work.el"))

## Linux<a id="sec-9-2" name="sec-9-2"></a>

Load my Linux-specific configs

    (when (string-equal system-type "gnu/linux")
      (load "~/.emacs-linux.el"))
